text<-"დაგლასმა არ მიიღო პარტიის ჩინოვნიკების რჩევა დაეცადა წლამდე როდესაც არჩევნებში მონაწილეობის მიღება რესპუბლიკელ სენატორ ნოულანდს მოუწევდა დაგლასის კამპანიის ერთ-ერთი უმთავრესი პრობლემა თავიდანვე თანხების მიზიდვა იყო მისი მეგობარი და დამხმარე ედ ლიბექი თვლიდა რომ საჭირო იყო დაახლოებით მილიონი დოლარი დღევანდელი კურსით 

 წლის ოქტომბერს დულლასი რადიოში გამოვიდა სიტყვით და საკუთარი კანდიდატურა წამოაყენა იქვე მან იერიში მიიტანა დოუნიზე მოქმედ სენატორს იგი უმოქმედოს დიდი ბიზნესის მარიონეტს და სანავთობო კომპანიების ინტერესების გამტარს უწოდებდა კამპანიის მენეჯერად დაგლასმა დაიქირავა ჰაროლდ ტიპტონი დაგლასი თვლიდა რომ დიდი განსხვავება მის და ნიქსონის რომელიც რესპუბლიკელთა პრაიმერის ფავორიტად მიიჩნეოდა პოზიციებში ამომრჩეველს მისკენ დაგლასისკენ მიიზიდავდა ამავე დროს დოუნი რომელსაც ჯანმრთელობასთან დაკავშირებული პრობლემები ჰქონოდა არ იყო ბოლომდე ჩამოყალიბებული ეყარა თუ არა კენჭი კიდევ ერთი ვადისთვის აშშ-ის სენატში საბოლოოდ დეკემბრის დასაწყისში იგი გამოვიდა სიტყვით სადაც საკუთარი კანდიდატურა წამოაყენა და გააკრიტიკა დაგლასი პრაიმერში აგრეთვე ჩაება ერლ დესმონდი კალიფორნიის სენატის წევრი საკრამენტოდან რომელიც მსოფლთმხედველობით დოუნისთან იყო ახლოს 

 წლის იანვარში დაგლასმა გახსნა კამპანიის შტაბ-ბინა ლოს-ანჯელესსა და სან-ფრანცისკოში ეს მიუთითებდა იმაზე რომ იგი არ აპირებდა უკან დახევას და პრაიმერიდან გასვლას დოუნიმ დუგლასს დებატები შესთავაზა თუმცა დაგლასმა რომელიც კარგი მოდებატე არ იყო უარი განაცხადა ორივე კანდიდატი ერთმანეთს პრეტენზიებს პრესისა და რადიოს საშუალებით უყენებდა დოუნი ხშირად ამბობდა რომ მისი ოპონენტის პოზიცია ექსტრემისტულ ხასიათს ატარებდა 

დაგლასმა საკუთარი კამპანია ფორმალურად თებერვალს წამოიწყო თუმცა ეს ამბავი გადაფარა ჭორებმა რომ იგი აღარ აპირებდა კენჭისყრას დაგლასმა ამ ყველაფერს პრესის ყურადღების მისაქცევად დოუნის მიერ წამოწყებული პოლიტიკური მანევრები უწოდა მარტს დოუნიმ რომლის შედეგიც გამოკითხვებში არ იყო კარგი განაცხადა რომ აღარ აპირებდა კენჭისყრას და მხარი დაუჭირა ს გამომცემელ მანჩესტერ ბოდის თავის განცხადებაში სენატორმა აღნიშნა რომ ჯანმრთელობის მდგომარეობიდან გამომდინარე არ აპირებდა „პირადი და აგრესიული ხასიათის კამპანიის წარმართვას დაგლასის ბიწიერი და არაეთიკური პროპაგანდის წინააღმდეგ 

ბოდიმ საჭირო დოკუმენტაცია შემდეგ დღეს შეავსო საბუთების მიღების ბოლო დღეს მის კანდიდატად დაყენების პეტიციას ხელი მოაწერეს ფლეტჩერ ბრაუნმა რესპუბლიკური პარტიის წევრმა და დოუნის კამპანიის მენეჯერმა უილ როჯერსმა ბოდის კანდიდატურას მხარს უჭერდნენ შტატის დემოკრატიული პარტიის ლიდერები და ნავთობის სფეროს წარმომადგენლები ისინი მას კანდიდატობას ჯერ კიდევ წელს სთხოვდნენ თუმცა მაშინ ბოდიმ უარი თქვა მოგვიანებით მან განაცხადა რომ წელს პრაიმერში ჩართვის მიზეზი იყო ის რომ ეს მისთვის გამოწვევა იქნებოდა და საინტერესო ხალხს შეხვდებოდა დაგლასი ბოდი და ნიქსონი მონაწილეობას იღებდნენ როგორც დემოკრატიული ისევე რესპუბლიკური პარტიის პრაიმერში 

დოუნის გამოთიშვას გამომცემელის სასარგებლოდ დაგლასმა იაფფასიანი ფანდი უწოდა დუგლასს არ უცდია დოუნისთან რომელიც აპრილიდან ბეთესდას საზღვაო საავადმყოფოში იმყოფებოდა  ურთიერთობის გაუმჯობესება ოპონენტის ცვლილებამ დაგლასისთვის როგორც პოზიტიური ისევე ნეგატიური ეფექტი იქონია პრაიმერში აღარ იღებდა მონაწილეობას მოქმედი სენატორი თუმცა მას აღარ დაუჭერდა მხარს ერთ ერთი იმ დიდი გამოცემებიდან რომელიც შეიძლებოდა მას გვერდში დადგომოდა "

output<-unlist(strsplit(text, ''))
output<-output[!output=='\n']
alphabet<-unique(output)

library (HMM)
states<-c("1", "2")
set.seed(1) 
p11<-runif(1)
p12<-1-p11
p21<-runif(1)
p22<-1-p21
hmm<-initHMM(states, alphabet, transProbs=matrix(c(p11, p12, p21, p22), byrow=TRUE, nrow=2))
result<-baumWelch (hmm, output, maxIterations=200)
result$hmm$emissionProbs[,result$hmm$emissionProbs[2,]>result$hmm$emissionProbs[1,] & result$hmm$emissionProbs[2,]>0.01]